In [3]:
import pandas as pd
import numpy as np

In [20]:
df=pd.DataFrame({'sex' :['M','F',np.nan,'M','F'],'score':[5,4,3,4,np.nan]})

In [21]:
df

   sex  score
0    M    5.0
1    F    4.0
2  NaN    3.0
3    M    4.0
4    F    NaN

In [12]:
#결측치 만들기
df['score']+1

0    6.0
1    5.0
2    4.0
3    5.0
4    NaN
Name: score, dtype: float64

In [13]:
#결측치 확인하기 명령어 isna
pd.isna(df)#dataframe에 결측치 확인해줘

     sex  score
0  False  False
1  False  False
2   True  False
3  False  False
4  False   True

In [14]:
pd.isna(df).sum()

sex      1
score    1
dtype: int64

In [23]:
# 결측치 있는 행 제거하기.dropna
#score 결측치 제거
df.dropna(subset=['score'])

   sex  score
0    M    5.0
1    F    4.0
2  NaN    3.0
3    M    4.0

In [33]:
df_nomiss=df.dropna(subset=['score'])
df_nomiss['score']

0    5.0
1    4.0
2    3.0
3    4.0
Name: score, dtype: float64

In [34]:
df_nomiss = df.dropna(subset=['score','sex'])
df_nomiss

  sex  score
0   M    5.0
1   F    4.0
3   M    4.0

In [36]:
# 모든 변수에 결측치 없는 데이터를 추출 .dropna()
df_nomiss2=df.dropna()
df_nomiss2

  sex  score
0   M    5.0
1   F    4.0
3   M    4.0

In [37]:
#결측치를 제거하지 않고 총합
df['score'].sum()

16.0

In [38]:
# 평균
df['score'].mean()

4.0

In [41]:
#성별로 구분
# 평균,합을 구하시오
df.groupby('sex').agg(mean_score=('score','mean'),sum_score=('score','sum'))

     mean_score  sum_score
sex
F           4.0        4.0
M           4.5        9.0

In [42]:
exam=pd.read_csv('exam.csv')
exam.head()

   id  nclass  math  english  science
0   1       1    50       98       50
1   2       1    60       97       60
2   3       1    45       86       78
3   4       1    30       98       58
4   5       2    25       80       65

In [44]:
# 2,4,7행 데이터를 NaN할당 Not a number 오류 숫자가 아닌 값들을 대표하는 오류값
exam.loc[[2,7,14],['math']]=np.nan

In [45]:
exam

    id  nclass  math  english  science
0    1       1  50.0       98       50
1    2       1  60.0       97       60
2    3       1   NaN       86       78
3    4       1  30.0       98       58
4    5       2  25.0       80       65
5    6       2  50.0       89       98
6    7       2  80.0       90       45
7    8       2   NaN       78       25
8    9       3  20.0       98       15
9   10       3  50.0       98       45
10  11       3  65.0       65       65
11  12       3  45.0       85       32
12  13       4  46.0       98       65
13  14       4  48.0       87       12
14  15       4   NaN       56       78
15  16       4  58.0       98       65
16  17       5  65.0       68       98
17  18       5  80.0       78       90
18  19       5  89.0       68       87
19  20       5  78.0       83       58

In [46]:
#math평균
exam['math'].mean()

55.23529411764706

In [ ]:
#값을 체우는 명령어 .fillna()
exam['math']=exam['math'].fillna()

In [47]:
#수학에 대한 결측치를 확인
exam['math'].isna().sum()

3

In [50]:
df=pd.DataFrame({'sex' : [1,2,1,8,2,1],'score':[5,4,3,4,2,6]})
df

   sex  score
0    1      5
1    2      4
2    1      3
3    8      4
4    2      2
5    1      6

In [52]:
df['sex'].value_counts(sort=False).sort_index()

1    3
2    2
8    1
Name: sex, dtype: int64

In [53]:
df['score'].value_counts(sort=False).sort_index()

2    1
3    1
4    2
5    1
6    1
Name: score, dtype: int64

In [55]:
#sex 8이면 NaN 할당
df['sex']=np.where(df['sex']==8,np.nan,df['sex'])
df

   sex  score
0  1.0      5
1  2.0      4
2  1.0      3
3  NaN      4
4  2.0      2
5  1.0      6

In [56]:
#scorer 가 5보다 크면 NaN 할당
df['score']=np.where(df['score']>5,np.nan,df['score'])
df

   sex  score
0  1.0    5.0
1  2.0    4.0
2  1.0    3.0
3  NaN    4.0
4  2.0    2.0
5  1.0    NaN

In [59]:
#sex ,score 결측치 제거
#sex별 분리
#score 평균 구하기
df.dropna(subset=['score','sex']).groupby('sex').agg(mean_score=('score','mean'))

     mean_score
sex
1.0         4.0
2.0         3.0